using UnityEngine;
using System.Collections;

//----------------------------------------------------
// プレイヤーの動きクラス
// 基本的にプレイヤーのクラスにこのクラスを
// インスタンス化させたものを持たせて動きをさせる
//----------------------------------------------------

public class CMovePlayer {

    //----------------------------------------------------------------------
    // コンストラクタ
    //----------------------------------------------------------------------
    // @Param	none		
    // @Return	none
    // @Date	2014/10/14  @Update 2014/10/14  @Author T.Kawashita      
    //----------------------------------------------------------------------
    private CMovePlayer()
    {

    }


    private void Update()
    { 
    }

}
