using UnityEngine;
using System.Collections;

//----------------------------------------------------
// プレイヤーの基本的なクラス
// 基底クラス
//----------------------------------------------------

public class CPlayer : MonoBehaviour {

    //----------------------------------------------------------------------
    // コンストラクタのようなもの
    //----------------------------------------------------------------------
    // @Param   none			
    // @Return	none
    // @Date	2014/10/14  @Update 2014/10/14  @Author T.Kawashita      
    //----------------------------------------------------------------------
	void Start () {
	}
	
	// Update is called once per frame
	void Update () {	
	}
}
